# Objects shared over application
#
# Day Name Strings
window.ru_Date =
  {
    dayNames: ["воскресенье", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота"]
    abbreviatedDayNames: ["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"]
    shortestDayNames: ["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"]
    firstLetterDayNames: ["В", "П", "В", "С", "Ч", "П", "С"]

    monthNames: [
      "января", "февраля", "марта", "апреля",
      "мая", "июня", "июля", "августа",
      "сентября", "октября", "ноябрь", "декабря"
    ]
    abbreviatedMonthNames: ["янв", "фев", "мар", "апр", "май", "июн", "июл", "авг", "сен", "окт", "ноя", "дек"]
  }

window.trafficText =
  [
    "Дороги свободны",
    "Дороги почти свободны",
    "Местами затруднения",
    "Местами затруднения",
    "Движение плотное",
    "Движение затрудненное",
    "Серьезные пробки",
    "Многокилометровые пробки",
    "Город стоит",
    "Лучше ехать на метро"
  ]

window.declensionBall =
  [
    "баллов",
    "балл",
    "балла",
    "балла",
    "балла",
    "баллов",
    "баллов",
    "баллов",
    "баллов",
    "баллов",
    "баллов",
  ]
